<template>
    <div class="bg-[#F4F6FC] py-[128px]">
        <div class="container">
            <div class="flex flex-col items-center mb-[47px]">
                <p class="font-bold text-[16px] leading-7 text-center text-[#282938] ">{{ qwer.Title }}</p>
                <h1 class="font-semibold text-[48px] leading-[64px] text-center text-[#282938] max-w-[630px] w-full">{{ qwer.TitleText }}</h1>
            </div>
            <div class=" flex flex-wrap">
                <div class="pl-[46px] mb-6 mx-3 p-4 bg-white max-w-[406px] max-h-[316px] w-full h-full"
                    v-for="item, index of Features" :key="index">
                    <img src="../../public/image/icon.png" alt="" class="mb-[16px]">
                    <h1 class="font-medium text-[24px] leading-7 text-[#282938]">{{ item.cardTitle }}</h1>
                    <p class="text-[16px] leading-7 max-w-[325px] w-full text-[#282938]">{{ item.cardText }}</p>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup>
import { ref } from 'vue'
const qwer = ref(
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
    }
)
const Features = ref([
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
    {
        Title: 'особенности',
        TitleText: 'Дизайн, который решает проблемы по одному продукту за раз',
        CardLogo: '../../public/image/Icon.png',
        cardTitle: 'Гарантия качества',
        cardText: 'Наша приверженность обеспечению качества означает тщательное тестирование и внимание к деталям, гарантируя, что каждый веб-сайт, который мы создаем, является безупречным шедевром, обеспечивающим удобство работы для вашей аудитории.'
    },
]
)
</script>

<style lang="scss" scoped></style>